
export type configProps = {
  name: string,
  children?: configProps[]
}

export const config: configProps = {
  name: "រដ្ឋមន្រ្តី",
  children: [
    {
      name: "ខុទ្ឋកាល័យ/ទីប្រឹក្សា/ជំនួយការ",
      children: [{
        name: 'រដ្ឋលេខាធិការ',
        children: [{
          name: 'អនុរដ្ឋលេខាធិការ',
          children: [{
            name: 'ទីប្រឹក្សា ឬអនុព័ន្ធពាណិជ្ចកម្មក្រៅប្រទេស'
          },
          {
            name: "ស្ថានបេសកកម្មអចិន្រ្តៃយ៍ ប្រចាំអង្គការពាណិជ្ជកម្មពិភពលោកនិងអង្គការអន្តរជាតិពាក់ព័ន្ធនិងវិស័យសេដ្ឋកិច្ច ពាណិជ្ជកម្ម"
          },
          {
            name: "មន្ទីរពាណិជ្ជកម្មរាជធានី-ខេត្ត"
          },
          {
            name: "នាយកដ្ឋានសវនកម្មផ្ទៃក្នុង"
          },
          {
            name: 'អគ្គធិការដ្ឋាន'
          },
          {
            name: 'អគ្កនាយកដ្ឋានរដ្ឋបាលនិងហិរញ្ញវត្ថុ'
          },
          {
            name: 'អគ្គនាយកដ្ឋានពាណិជ្ជកម្មអន្តរជាតិ'
          },
          {
            name: 'អគ្គនាយកដ្ឋានពាណិជ្ជកម្មក្នុងប្រទេស'
          },
          {
            name: 'អគ្គនាយកដ្ឋានសេវាកម្មពាណិជ្ចកម្ម'
          },
          {
            name: 'អគ្គនាយកដ្ឋានជំរុញពាណិជ្ជកម្ម'
          },
          {
            name: 'អគ្គនាយកដ្ឋានការពារអ្នកប្រើប្រាស់ កិច្ចការប្រកួតប្រជែងនិងបង្រ្កាបការក្លៃងបន្លំ'
          }]
        }]
      }]
    }
  ]
}